-- Description: 儲位重量表中重量不對更換方式
-- Usage: 
-- db_name: STG0儲位異動 STG0儲位重量表
-- ========================================

----------------------------------------------
-- 查詢集貨序號重複 
----------------------------------------------
SELECT *
FROM STG0儲位異動 AS a
WHERE EXISTS (
    SELECT 1
    FROM STG0儲位異動 AS b
    WHERE a.[集貨序號] = b.[集貨序號]
      AND a.[異動重量] = b.[異動重量]
    GROUP BY b.[集貨序號], b.[異動重量]
    HAVING COUNT(*) > 1
)
ORDER BY a.[集貨序號], a.[異動重量];
----------------------------------------------
-- 保留一筆
----------------------------------------------
WITH CTE AS (
    SELECT *,
           ROW_NUMBER() OVER (PARTITION BY [集貨序號], [異動重量] ORDER BY (SELECT NULL)) AS rn
    FROM STG0儲位異動
)
DELETE FROM CTE WHERE rn > 1;
----------------------------------------------
--- 儲位小於0
----------------------------------------------
SELECT [儲位], SUM([異動重量]) AS 總重量
FROM [dbo].[STG0儲位異動]
GROUP BY [儲位]
HAVING SUM([異動重量]) < 0
ORDER BY [儲位];
----------------------------------------------
--- 找出小於0的資料
----------------------------------------------
SELECT * 
FROM [dbo].[STG0儲位異動]
WHERE [儲位] IN (
    SELECT [儲位]
    FROM [dbo].[STG0儲位異動]
    GROUP BY [儲位]
    HAVING SUM([異動重量]) < 0
);
----------------------------------------------
--- 刪除小於0的資料
----------------------------------------------
Delete
FROM [dbo].[STG0儲位異動]
WHERE [儲位] IN (
    SELECT [儲位]
    FROM [dbo].[STG0儲位異動]
    GROUP BY [儲位]
    HAVING SUM([異動重量]) < 0
);
----------------------------------------------
-- 異動明細加總重量更新儲位重量表的重量
----------------------------------------------  
UPDATE W
SET W.[總重量] = T.總重量
FROM [dbo].[STG0儲位重量表] W
JOIN (
    SELECT [儲位], SUM([異動重量]) AS 總重量
    FROM [dbo].[STG0儲位異動]
    GROUP BY [儲位]
) T
ON W.[儲位] = T.[儲位];